### Terraform Plan: `staging`

<details><summary>Show plan</summary>

```
data.terraform_remote_state.shared: Reading...
module.env.random_password.db_password: Refreshing state... [id=none]
module.env.random_password.zitadel_db_password: Refreshing state... [id=none]
module.env.random_password.zitadel_admin_password: Refreshing state... [id=none]
module.env.google_compute_global_address.web_ipv4: Refreshing state... [id=projects/pocket-av/global/addresses/pocket-av-web-ip-staging]
module.env.google_vpc_access_connector.connector: Refreshing state... [id=projects/pocket-av/locations/us-central1/connectors/run-connector-staging]
module.env.google_storage_bucket.recordings: Refreshing state... [id=pocket-av-recordings-staging]
module.env.google_secret_manager_secret.zitadel_db_password: Refreshing state... [id=projects/pocket-av/secrets/zitadel-db-password-staging]
module.env.google_compute_global_address.api_ipv4: Refreshing state... [id=projects/pocket-av/global/addresses/pocket-av-api-ip-staging]
module.env.google_compute_global_address.auth_ipv4: Refreshing state... [id=projects/pocket-av/global/addresses/pocket-av-auth-ip-staging]
module.env.google_compute_url_map.auth_http_redirect: Refreshing state... [id=projects/pocket-av/global/urlMaps/pocket-av-auth-http-redirect-staging]
module.env.google_compute_url_map.web_http_redirect: Refreshing state... [id=projects/pocket-av/global/urlMaps/pocket-av-web-http-redirect-staging]
module.env.google_compute_url_map.api_http_redirect: Refreshing state... [id=projects/pocket-av/global/urlMaps/pocket-av-api-http-redirect-staging]
data.terraform_remote_state.shared: Read complete after 0s
module.env.google_secret_manager_secret.zitadel_admin_password: Refreshing state... [id=projects/pocket-av/secrets/zitadel-admin-password-staging]
module.env.google_service_account.zitadel: Refreshing state... [id=projects/pocket-av/serviceAccounts/zitadel-staging@pocket-av.iam.gserviceaccount.com]
module.env.google_service_account.keycache_server: Refreshing state... [id=projects/pocket-av/serviceAccounts/keycache-server-staging@pocket-av.iam.gserviceaccount.com]
module.env.google_secret_manager_secret.db_password: Refreshing state... [id=projects/pocket-av/secrets/db-password-staging]
module.env.google_secret_manager_secret_version.zitadel_admin_password: Refreshing state... [id=projects/148242134126/secrets/zitadel-admin-password-staging/versions/1]
module.env.google_secret_manager_secret_version.zitadel_db_password: Refreshing state... [id=projects/148242134126/secrets/zitadel-db-password-staging/versions/1]
module.env.google_compute_target_http_proxy.auth: Refreshing state... [id=projects/pocket-av/global/targetHttpProxies/pocket-av-auth-http-staging]
module.env.google_sql_database_instance.main: Refreshing state... [id=pocket-av-db-staging]
module.env.google_compute_managed_ssl_certificate.auth: Refreshing state... [id=projects/pocket-av/global/sslCertificates/pocket-av-auth-cert-staging]
module.env.google_storage_bucket.web: Refreshing state... [id=staging.pocket-rad.io]
module.env.google_compute_managed_ssl_certificate.api: Refreshing state... [id=projects/pocket-av/global/sslCertificates/pocket-av-api-cert-staging]
module.env.google_dns_record_set.web_a: Refreshing state... [id=projects/pocket-av/managedZones/pocket-rad-io/rrsets/staging.pocket-rad.io./A]
module.env.google_compute_managed_ssl_certificate.web: Refreshing state... [id=projects/pocket-av/global/sslCertificates/pocket-av-web-cert-staging]
module.env.google_dns_record_set.auth_a: Refreshing state... [id=projects/pocket-av/managedZones/pocket-rad-io/rrsets/auth-staging.pocket-rad.io./A]
module.env.google_project_iam_member.zitadel_secret_accessor: Refreshing state... [id=pocket-av/roles/secretmanager.secretAccessor/serviceAccount:zitadel-staging@pocket-av.iam.gserviceaccount.com]
module.env.google_service_account_iam_member.keycache_server_token_creator: Refreshing state... [id=projects/pocket-av/serviceAccounts/keycache-server-staging@pocket-av.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:keycache-server-staging@pocket-av.iam.gserviceaccount.com]
module.env.google_project_iam_member.keycache_server_roles["roles/cloudsql.client"]: Refreshing state... [id=pocket-av/roles/cloudsql.client/serviceAccount:keycache-server-staging@pocket-av.iam.gserviceaccount.com]
module.env.google_project_iam_member.keycache_server_roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=pocket-av/roles/secretmanager.secretAccessor/serviceAccount:keycache-server-staging@pocket-av.iam.gserviceaccount.com]
module.env.google_storage_bucket_iam_member.recordings_admin: Refreshing state... [id=b/pocket-av-recordings-staging/roles/storage.objectAdmin/serviceAccount:keycache-server-staging@pocket-av.iam.gserviceaccount.com]
module.env.google_secret_manager_secret_version.db_password: Refreshing state... [id=projects/148242134126/secrets/db-password-staging/versions/1]
module.env.google_dns_record_set.api_a: Refreshing state... [id=projects/pocket-av/managedZones/pocket-rad-io/rrsets/api-staging.pocket-rad.io./A]
module.env.google_storage_bucket_iam_member.web_public: Refreshing state... [id=b/staging.pocket-rad.io/roles/storage.objectViewer/allUsers]
module.env.google_compute_backend_bucket.web: Refreshing state... [id=projects/pocket-av/global/backendBuckets/pocket-av-web-backend-staging]
module.env.google_storage_bucket_iam_member.web_deployer: Refreshing state... [id=b/staging.pocket-rad.io/roles/storage.objectAdmin/serviceAccount:github-actions@pocket-av.iam.gserviceaccount.com]
module.env.google_compute_target_http_proxy.api: Refreshing state... [id=projects/pocket-av/global/targetHttpProxies/pocket-av-api-http-staging]
module.env.google_compute_target_http_proxy.web: Refreshing state... [id=projects/pocket-av/global/targetHttpProxies/pocket-av-web-http-staging]
module.env.google_sql_database.keycache: Refreshing state... [id=projects/pocket-av/instances/pocket-av-db-staging/databases/keycache]
module.env.google_sql_database.zitadel: Refreshing state... [id=projects/pocket-av/instances/pocket-av-db-staging/databases/zitadel]
module.env.google_sql_user.app: Refreshing state... [id=ssdb//pocket-av-db-staging]
module.env.google_sql_user.zitadel: Refreshing state... [id=zitadel//pocket-av-db-staging]
module.env.google_cloud_run_v2_service.zitadel: Refreshing state... [id=projects/pocket-av/locations/us-central1/services/zitadel-staging]
module.env.google_compute_global_forwarding_rule.auth_http: Refreshing state... [id=projects/pocket-av/global/forwardingRules/pocket-av-auth-http-fwd-staging]
module.env.google_compute_global_forwarding_rule.web_http: Refreshing state... [id=projects/pocket-av/global/forwardingRules/pocket-av-web-http-fwd-staging]
module.env.google_compute_global_forwarding_rule.api_http: Refreshing state... [id=projects/pocket-av/global/forwardingRules/pocket-av-api-http-fwd-staging]
module.env.google_cloud_run_v2_service.keycache_server: Refreshing state... [id=projects/pocket-av/locations/us-central1/services/keycache-server-staging]
module.env.google_compute_url_map.web: Refreshing state... [id=projects/pocket-av/global/urlMaps/pocket-av-web-staging]
module.env.google_cloud_run_v2_service_iam_member.public: Refreshing state... [id=projects/pocket-av/locations/us-central1/services/keycache-server-staging/roles/run.invoker/allUsers]
module.env.google_compute_region_network_endpoint_group.api_neg: Refreshing state... [id=projects/pocket-av/regions/us-central1/networkEndpointGroups/pocket-av-api-neg-staging]
module.env.google_compute_target_https_proxy.web: Refreshing state... [id=projects/pocket-av/global/targetHttpsProxies/pocket-av-web-https-staging]
module.env.google_compute_global_forwarding_rule.web_https: Refreshing state... [id=projects/pocket-av/global/forwardingRules/pocket-av-web-https-fwd-staging]
module.env.google_compute_backend_service.api: Refreshing state... [id=projects/pocket-av/global/backendServices/pocket-av-api-backend-staging]
module.env.google_compute_url_map.api: Refreshing state... [id=projects/pocket-av/global/urlMaps/pocket-av-api-staging]
module.env.google_compute_target_https_proxy.api: Refreshing state... [id=projects/pocket-av/global/targetHttpsProxies/pocket-av-api-https-staging]
module.env.google_compute_global_forwarding_rule.api_https: Refreshing state... [id=projects/pocket-av/global/forwardingRules/pocket-av-api-https-fwd-staging]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.env.google_cloud_run_v2_service.zitadel is tainted, so must be replaced
-/+ resource "google_cloud_run_v2_service" "zitadel" {
      - annotations             = {} -> null
      ~ conditions              = [
          - {
              - last_transition_time = "2026-03-19T22:45:42.858533Z"
              - message              = <<-EOT
                    The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=pocket-av&resource=cloud_run_revision/service_name/zitadel-staging/revision_name/zitadel-staging-00001-bgd&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22zitadel-staging%22%0Aresource.labels.revision_name%3D%22zitadel-staging-00001-bgd%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - state                = "CONDITION_FAILED"
              - type                 = "RoutesReady"
                # (3 unchanged attributes hidden)
            },
          - {
              - last_transition_time = "2026-03-19T22:45:42.770348Z"
              - message              = <<-EOT
                    The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=pocket-av&resource=cloud_run_revision/service_name/zitadel-staging/revision_name/zitadel-staging-00001-bgd&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22zitadel-staging%22%0Aresource.labels.revision_name%3D%22zitadel-staging-00001-bgd%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - state                = "CONDITION_FAILED"
              - type                 = "ConfigurationsReady"
                # (3 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ create_time             = "2026-03-19T22:45:30.279778Z" -> (known after apply)
      ~ creator                 = "github-actions@pocket-av.iam.gserviceaccount.com" -> (known after apply)
      - custom_audiences        = [] -> null
      + delete_time             = (known after apply)
      ~ effective_annotations   = {} -> (known after apply)
      ~ etag                    = "\"CIr58c0GENCltIUB/cHJvamVjdHMvcG9ja2V0LWF2L2xvY2F0aW9ucy91cy1jZW50cmFsMS9zZXJ2aWNlcy96aXRhZGVsLXN0YWdpbmc\"" -> (known after apply)
      + expire_time             = (known after apply)
      ~ generation              = "1" -> (known after apply)
      ~ id                      = "projects/pocket-av/locations/us-central1/services/zitadel-staging" -> (known after apply)
      - invoker_iam_disabled    = false -> null
      - labels                  = {} -> null
      ~ last_modifier           = "github-actions@pocket-av.iam.gserviceaccount.com" -> (known after apply)
      ~ latest_created_revision = "projects/pocket-av/locations/us-central1/services/zitadel-staging/revisions/zitadel-staging-00001-bgd" -> (known after apply)
      + latest_ready_revision   = (known after apply)
      ~ launch_stage            = "GA" -> (known after apply)
        name                    = "zitadel-staging"
      ~ observed_generation     = "1" -> (known after apply)
      ~ reconciling             = false -> (known after apply)
      ~ terminal_condition      = [
          - {
              - last_transition_time = "2026-03-19T22:45:42.858533Z"
              - message              = <<-EOT
                    The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=pocket-av&resource=cloud_run_revision/service_name/zitadel-staging/revision_name/zitadel-staging-00001-bgd&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22zitadel-staging%22%0Aresource.labels.revision_name%3D%22zitadel-staging-00001-bgd%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - state                = "CONDITION_FAILED"
              - type                 = "Ready"
                # (3 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ traffic_statuses        = [] -> (known after apply)
      ~ uid                     = "539bf33c-8009-41ad-b88a-bc6a7cc4310e" -> (known after apply)
      ~ update_time             = "2026-03-19T22:45:30.279778Z" -> (known after apply)
      + uri                     = (known after apply)
      ~ urls                    = [
          - "https://zitadel-staging-148242134126.us-central1.run.app",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ scaling {
          - manual_instance_count = 0 -> null
          - min_instance_count    = 0 -> null
            # (1 unchanged attribute hidden)
        }

      ~ template {
          - annotations                      = {} -> null
          - gpu_zonal_redundancy_disabled    = false -> null
          - labels                           = {} -> null
          ~ max_instance_request_concurrency = 160 -> (known after apply)
          - session_affinity                 = false -> null
            # (5 unchanged attributes hidden)

          ~ containers {
              - args           = [] -> null
              ~ build_info     = [] -> (known after apply)
              - depends_on     = [] -> null
                name           = null
                # (4 unchanged attributes hidden)

              ~ ports {
                  ~ name           = "http1" -> (known after apply)
                    # (1 unchanged attribute hidden)
                }

              ~ resources {
                  - cpu_idle          = false -> null
                  ~ limits            = {
                      ~ "memory" = "512Mi" -> "1Gi"
                        # (1 unchanged element hidden)
                    }
                  - startup_cpu_boost = false -> null
                }

              ~ startup_probe {
                  ~ failure_threshold     = 1 -> 30
                  ~ initial_delay_seconds = 0 -> 10
                  ~ period_seconds        = 240 -> 10
                  ~ timeout_seconds       = 240 -> 5

                  + http_get {
                      + path = "/debug/healthz"
                      + port = 8080
                    }

                  - tcp_socket {
                      - port = 8080 -> null
                    }
                }

                # (16 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

      ~ traffic (known after apply)
      - traffic {
          - percent  = 100 -> null
          - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.env.google_cloud_run_v2_service_iam_member.zitadel_public will be created
  + resource "google_cloud_run_v2_service_iam_member" "zitadel_public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + name     = "zitadel-staging"
      + project  = "pocket-av"
      + role     = "roles/run.invoker"
    }

  # module.env.google_compute_backend_service.auth will be created
  + resource "google_compute_backend_service" "auth" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "pocket-av-auth-backend-staging"
      + port_name                       = (known after apply)
      + project                         = "pocket-av"
      + protocol                        = "HTTPS"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 30

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + cdn_policy (known after apply)

      + iap (known after apply)

      + log_config (known after apply)
    }

  # module.env.google_compute_global_forwarding_rule.auth_https will be created
  + resource "google_compute_global_forwarding_rule" "auth_https" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + forwarding_rule_id    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = "projects/pocket-av/global/addresses/pocket-av-auth-ip-staging"
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "pocket-av-auth-https-fwd-staging"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "443"
      + project               = "pocket-av"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # module.env.google_compute_region_network_endpoint_group.auth_neg will be created
  + resource "google_compute_region_network_endpoint_group" "auth_neg" {
      + id                    = (known after apply)
      + name                  = "pocket-av-auth-neg-staging"
      + network_endpoint_type = "SERVERLESS"
      + project               = "pocket-av"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "zitadel-staging"
        }

      + psc_data (known after apply)
    }

  # module.env.google_compute_target_https_proxy.auth will be created
  + resource "google_compute_target_https_proxy" "auth" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + name               = "pocket-av-auth-https-staging"
      + project            = "pocket-av"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = [
          + "projects/pocket-av/global/sslCertificates/pocket-av-auth-cert-staging",
        ]
      + tls_early_data     = (known after apply)
      + url_map            = (known after apply)
    }

  # module.env.google_compute_url_map.auth will be created
  + resource "google_compute_url_map" "auth" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "pocket-av-auth-staging"
      + project            = "pocket-av"
      + self_link          = (known after apply)
    }

Plan: 7 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>